Examples/PythonIntegration/multiRegionHeaterBuildFunctionObjects/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     chtMultiRegionFoam;

startFrom       latestTime;

startTime       0.001;

stopAt          endTime;

endTime         200;

deltaT          0.001;

writeControl    adjustableRunTime;

writeInterval   50;

purgeWrite      0;

writeFormat     binary;

writePrecision  8;

writeCompression uncompressed;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

maxCo           0.3;

// Maximum diffusion number
maxDi           10.0;

adjustTimeStep  yes;

libs
(
    "libOpenFOAM.so"
    "libcompressibleTurbulenceModel.so"
    "libcompressibleRASModels.so"
    "libswakPythonIntegration.so"
    "libsimpleSwakFunctionObjects.so"
);

functions {
    dynamicBuildAverageTemperatures {
        type dynamicFunctionObjectListProxy;
        dictionaryProvider stdoutFromPythonScriptProvider;
        scriptFile "$FOAM_CASE/buildTemperatureFOs.py";
        interactiveAfterException true;
        readDuringConstruction true;
        region heater;
        parallelMasterOnly true;
        //        isParallelized true;
    }
}

// ************************************************************************* //
