Examples/PythonIntegration/multiRegionHeaterBuildFunctionObjects/system/rightSolid/changeDictionaryDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      changeDictionaryDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dictionaryReplacement
{
    boundary
    {
        minZ
        {
            type            patch;
        }
        maxZ
        {
            type            patch;
        }
    }

    T
    {
        internalField   uniform 300;

        boundaryField
        {
            ".*"
            {
                type            zeroGradient;
                value           uniform 300;
            }
            "rightSolid_to_.*"
            {
                type            compressible::turbulentTemperatureCoupledBaffleMixed;
                neighbourFieldName T;
                K               solidThermo;
                KName           none;
                value           uniform 300;
            }
        }
    }

    Ypmma
    {
        internalField   uniform 0.5;


        boundaryField
        {
            ".*"
            {
                type            calculated;
                value           uniform 0.5;
            }
        }

    }

    Ychar
    {
        internalField   uniform 0.5;

        boundaryField
        {
            ".*"
            {
                type            calculated;
                value           uniform 0.5;
            }
        }
    }
}

// ************************************************************************* //
